{
  "week_start": "2026-02-05",
  "week_end": "2026-02-11",
  "pr_count": 40,
  "mood": "symphonic shipping",
  "theme": "A massive expansion of sensory capabilities: video generation, music creation, and speech synthesis are now first-class citizens.",
  "arcs": [
    {
      "headline": "The Full A/V Studio Experience",
      "summary": "We unlocked a massive suite of multimedia tools. Video generation took a leap with LTX-2 and Grok Video. Audio got a complete overhaul with ElevenLabs Music (duration-based), ElevenLabs v3 TTS (emotional speech), and OVH Whisper for transcription.",
      "days": [
        "2026-02-06",
        "2026-02-07",
        "2026-02-08"
      ],
      "importance": "major"
    },
    {
      "headline": "Agents, Bots, and Open Source",
      "summary": "We open-sourced Polly (our Discord bot) so the community can build their own autonomous coding agents. We also rolled out a seamless integration for OpenClaw, letting developers spin up AI agents with a single setup command.",
      "days": [
        "2026-02-08",
        "2026-02-10",
        "2026-02-11"
      ],
      "importance": "major"
    },
    {
      "headline": "Play Page is the New Documentation",
      "summary": "We redesigned the frontend to merge the 'Docs' directly into the 'Play' page. Now, as you tweak parameters in the UI, you get live, copy-pasteable API code for that exact configuration—bridging the gap between experimenting and building.",
      "days": [
        "2026-02-08",
        "2026-02-10"
      ],
      "importance": "major"
    },
    {
      "headline": "Infrastructure & Billing Tuning",
      "summary": "We migrated Mistral to OVHcloud for better stability, optimized z-image for speed, and simplified the billing API into a single-bucket system that handles negative balances gracefully.",
      "days": [
        "2026-02-06",
        "2026-02-09"
      ],
      "importance": "minor"
    }
  ],
  "changelog_md": "## Week of Feb 5-11, 2026\n\n### 🎥 Audio & Video Revolution\n- **Video Generation:** Added LTX-2 (1024x1024 with audio), Grok Video, and Imagen 4 support.\n- **Music & Speech:** Integrated ElevenLabs Music (`elevenmusic`) with duration billing and upgraded TTS to ElevenLabs v3 for emotional range.\n- **Transcription:** Added OVH Whisper Large V3 for high-accuracy speech-to-text.\n- **Discovery:** Added a programmatic `/audio/models` endpoint for developers.\n\n### 🤖 Agents & Community\n- **Polly Open Source:** Released the full source code for our Discord bot, featuring semantic search and autonomous coding capabilities.\n- **OpenClaw Integration:** Launched a dedicated landing page and auto-setup script to onboard OpenClaw agents in one command.\n- **Roleplay Models:** Added `qwen-character` specifically optimized for roleplay scenarios.\n\n### 💅 UX & Developer Experience\n- **Unified Play/Docs:** Merged documentation into the Play page—configure a model visually, then copy the generated API code instantly.\n- **Frontend Redesign:** Fresh header authentication, theme customization, and improved mobile responsiveness.\n- **Billing Simplification:** The balance API now returns a single unified field, and the system now gracefully handles temporary negative balances.\n\n### ⚡ Performance & Fixes\n- **Speed:** Optimized `z-image` and `flux-klein` for faster generation and lower memory usage.\n- **Stability:** Migrated Mistral to OVHcloud and moved Portkey gateway to a custom domain to eliminate timeouts on long requests.\n- **GSoC:** Cleaned up documentation and improved dashboard navigation for Summer of Code participants.",
  "pr_summary": "WEEKLY UPDATES (40 merged PRs):\n- #7903: feat: Add LTX-2 video generation model\n- #8072: feat: add elevenmusic model with duration-based billing\n- #8068: feat: add OVH Whisper speech-to-text transcription\n- #8078: Add Polly Discord Bot source code\n- #8130: feat: merge Docs page into Play page Integrate section\n- #8165: feat: OpenClaw integration landing page & setup\n- #8004: Upgrade claude-large to Opus 4.6 on Bedrock\n- #8117: fix: single-bucket balance deduction"
}